<a href="https://colab.research.google.com/github/RafaelCaballero/APD/blob/main/codigo/unirDataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<table>
<tr>
<td><img src="https://raw.githubusercontent.com/RafaelCaballero/APD/refs/heads/main/img/logoAPD.png" width="150"></td>
<td><table><tr><td><h1>Pandas - Unir Dataframes</h1></td></tr>
           <tr><td><h3>Rafael Caballero Roldán</h3></td></tr></table></td>
<td><img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTsPjCdm67xYS9AM7-dXQ46O23vaexAhnVJaQ&s" width="105"></td>
</tr>
</table>

### Combinando dataframes
Veamos en este Notebook cómo se combinan y agregan dataframes en uno solo

### Índice
[Concatenar](#Concatenar)<br>
[Merge](#Merge)<br>

El siguiente código es para mostrar una dataframe al lado de otro, ejecutarlo pero no hace falta entenderlo

In [ ]:
from IPython.display import display, HTML
from IPython.display import display_html
from IPython.display import Markdown

def display_side_by_side(*args,title=""):
    print(title)
    html_str = ''
    for df in args:
        html_str += '&nbsp;&nbsp;&nbsp;'+df.to_html()
    display_html(
        html_str.replace('table','table style="display:inline"'),
        raw=True)

<a name="Concatenar"></a>
### Concatenar

La forma más fácil, y a veces la más rápida y útil, de combinar dataframes, ya sea "pegándolo" debajo o al lado con `pd.concat`

<img src = "https://miro.medium.com/max/1050/1*0wu6DunCzPC4o9FIyRTW4w.png">

In [ ]:
import IPython.display as display
import pandas as pd
from pandas import DataFrame
from random import sample


df1 = DataFrame({'clave': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data': range(7),
                 'otro': sample(range(10, 30), 7)})

df2 = DataFrame({'clave': ['e', 'e', 'e', 'e'],
                 'data': range(4),
                 'otro': sample(range(10, 30), 4)})

display_side_by_side(df1,df2)

,clave,data,otro
0,b,0,27
1,b,1,11
2,a,2,14
3,c,3,13
4,a,4,29
5,a,5,16
6,b,6,28
,clave,data,otro
0,e,0,11
1,e,1,28
2,e,2,19
3,e,3,14

In [ ]:
df3 = pd.concat([df1,df2])
df3

  clave  data  otro
0     b     0    27
1     b     1    11
2     a     2    14
3     c     3    13
4     a     4    29
5     a     5    16
6     b     6    28
0     e     0    11
1     e     1    28
2     e     2    19
3     e     3    14

Si nos incomoda que el índice no sea consecutivo:

In [ ]:
df3 = df3.reset_index(drop=True)
df3

   clave  data  otro
0      b     0    27
1      b     1    11
2      a     2    14
3      c     3    13
4      a     4    29
5      a     5    16
6      b     6    28
7      e     0    11
8      e     1    28
9      e     2    19
10     e     3    14

Sin embargo, hay veces que es útil usar el índice (si no tiene ya otro cometido) para "apuntar" el origen de cada fila

In [ ]:
import IPython.display as display
import pandas as pd

df1 = DataFrame({'clave': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data': range(7),
                 'otro': sample(range(10, 30), 7)})

df2 = DataFrame({'clave': ['e', 'e', 'e', 'e'],
                 'data': range(4),
                 'otro': sample(range(10, 30), 4)})

df1.index = ["A"]*len(df1)
df2.index = ["B"]*len(df2)
display_side_by_side(df1,df2,pd.concat([df1,df2]),title="pd.concat([df1,df2])")

pd.concat([df1,df2])

,clave,data,otro
A,b,0,10
A,b,1,11
A,a,2,17
A,c,3,28
A,a,4,20
A,a,5,13
A,b,6,22
,clave,data,otro
B,e,0,20
B,e,1,21
B,e,2,10
B,e,3,23
,clave,data,otro
A,b,0,10
A,b,1,11
A,a,2,17
A,c,3,28
A,a,4,20
A,a,5,13
A,b,6,22
B,e,0,20
B,e,1,21
B,e,2,10
B,e,3,23

**Ojo** porque `concat` no es tan *tonto* como parece; no se limita a pegar debajo sino que alinea por nombres de columna

In [ ]:
import IPython.display as display
import pandas as pd

df1 = DataFrame({'clave': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data': range(7),
                 'otro': sample(range(10, 30), 7)})

df2 = DataFrame({'clave': ['e', 'e', 'e', 'e'],
                 'otro': sample(range(10, 30), 4),
                 'data': range(4) } )

df1.index = ["A"]*len(df1)
df2.index = ["B"]*len(df2)
display_side_by_side(df1,df2,pd.concat([df1,df2]), title="pd.concat([df1,df2])")

pd.concat([df1,df2])

,clave,data,otro
A,b,0,15
A,b,1,23
A,a,2,16
A,c,3,18
A,a,4,22
A,a,5,17
A,b,6,12
,clave,otro,data
B,e,22,0
B,e,14,1
B,e,11,2
B,e,10,3
,clave,data,otro
A,b,0,15
A,b,1,23
A,a,2,16
A,c,3,18
A,a,4,22
A,a,5,17
A,b,6,12
B,e,0,22
B,e,1,14
B,e,2,11
B,e,3,10

Con el parámetro axis (que por defecto vale 0) podemos hacer que en lugar de por filas concatene por columnas. En este caso lo lógico es que ambos dataframes tengan el mismo número de filas

In [ ]:
import numpy as np
filas = 5
df1 = DataFrame({'A': np.random.randint(1,10,filas) ,
                 'B': np.random.randint(1,10,filas),
                 'C': np.random.randint(1,10,filas)})

df2 = DataFrame({'D': np.random.randint(2000,3000,filas),
                 'E': np.random.randint(2000,3000,filas)})
display_side_by_side(df1,df2, pd.concat([df1,df2],axis=1),
                     title="pd.concat([df1,df2],axis=1)")

pd.concat([df1,df2],axis=1)

Un aspecto muy importante: igual que al concatenar utiliza los nombres de columna aquí va a usar los números de fila

In [ ]:
df2.index=[0,1,2,4,7]
display_side_by_side(df1,df2, pd.concat([df1,df2],axis=1),
                     title="pd.concat([df1,df2],axis=1)")

pd.concat([df1,df2],axis=1)

Si el número de filas o columnas no encaja, `concat` añadirá valores vacío para completar

In [ ]:
import numpy as np
filas = 5
df1 = DataFrame({'A': np.random.randint(1,10,filas) ,
                 'B': np.random.randint(1,10,filas),
                 'C': np.random.randint(1,10,filas)})

df2 = DataFrame({'D': np.random.randint(2000,3000,filas-1),
                 'E': np.random.randint(2000,3000,filas-1)})
display_side_by_side(df1,df2, pd.concat([df1,df2],axis=1),title="pd.concat([df1,df2],axis=1)")

display_side_by_side(df1,df2, pd.concat([df1,df2],axis=0),title="pd.concat([df1,df2],axis=0)")

pd.concat([df1,df2],axis=1)

pd.concat([df1,df2],axis=0)

**Ejercicio**  El siguiente código descarga tres ficheros con datos diarios de metereología en Madrid y sus metadatos a una carpeta ./raw

In [ ]:
import requests
from pathlib import Path
path = Path.cwd()
pathraw = Path(path,"raw")

pathraw.mkdir(exist_ok=True)

datos = [
         "https://datos.madrid.es/egob/catalogo/300351-0-meteorologicos-diarios.csv",
         "https://datos.madrid.es/egob/catalogo/300351-3-meteorologicos-diarios.csv",
          "https://datos.madrid.es/egob/catalogo/300351-9-meteorologicos-diarios.csv"
          ]
locales = []
for url in datos:
    nombre = Path(url).name
    camino = Path(pathraw,nombre)
    r = requests.get(url, allow_redirects=True) # el fichero queda en la variable r
    if r.status_code==200:
        with open(camino, 'wb') as f:
            f.write(r.content) # ahora lo grabamos localmente
        print("Grabado,",camino)
        locales.append(camino)
    else:
        print("Error descargando ",url,r.status_code)

Grabado, d:\docencia\2526\apd\codigo\raw\300351-0-meteorologicos-diarios.csv
Grabado, d:\docencia\2526\apd\codigo\raw\300351-3-meteorologicos-diarios.csv
Grabado, d:\docencia\2526\apd\codigo\raw\300351-9-meteorologicos-diarios.csv

In [ ]:
locales

[WindowsPath('d:/docencia/2526/apd/codigo/raw/300351-0-meteorologicos-diarios.csv'),
 WindowsPath('d:/docencia/2526/apd/codigo/raw/300351-3-meteorologicos-diarios.csv'),
 WindowsPath('d:/docencia/2526/apd/codigo/raw/300351-9-meteorologicos-diarios.csv')]

Añadir código para combinar los ficheros que empiezan por nombre 300351 y tienen como extensión csv de la carpeta raw en uno solo sabiendo que tienen las mismas columnas

1.- Obtenemos los paths a estos ficheros (realmente  ya lo tenemos en la vairable `locales`)

In [ ]:
csvs = list(pathraw.glob("300351*.csv"))
csvs

[WindowsPath('d:/docencia/2526/apd/codigo/raw/300351-0-meteorologicos-diarios.csv'),
 WindowsPath('d:/docencia/2526/apd/codigo/raw/300351-3-meteorologicos-diarios.csv'),
 WindowsPath('d:/docencia/2526/apd/codigo/raw/300351-9-meteorologicos-diarios.csv')]

2.- Los leemos todos, generando una lita de dataframes

In [ ]:
dfs = [pd.read_csv(nombre,sep=";")  for nombre in csvs]

3.- Los juntamos uno debajo de otro

In [ ]:
df = pd.concat(dfs)
df

,PROVINCIA,MUNICIPIO,ESTACION,MAGNITUD,PUNTO_MUESTREO,ANO,MES,D01,V01,D02,...,D27,V27,D28,V28,D29,V29,D30,V30,D31,V31
0,28,79,102,81,28079102_81_98,2019,1,0.66,V,1.16,...,2.57,V,2.93,V,3.23,V,3.18,V,4.72,V
1,28,79,102,81,28079102_81_98,2019,2,4.32,V,2.98,...,1.36,V,0.97,V,0.00,N,0.00,N,0.00,N
2,28,79,102,81,28079102_81_98,2019,3,1.57,V,1.13,...,1.48,V,1.69,V,2.89,V,1.99,V,1.72,V
3,28,79,102,81,28079102_81_98,2019,4,1.32,V,1.21,...,1.00,V,1.82,V,1.97,V,1.84,V,0.00,N
4,28,79,102,81,28079102_81_98,2019,5,2.06,V,2.21,...,1.77,V,3.32,V,3.76,V,3.04,V,1.89,V
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
928,28,79,59,89,28079059_89_98,2022,8,0.00,V,0.00,...,0.00,V,0.00,V,0.00,V,0.00,V,0.00,V
929,28,79,59,89,28079059_89_98,2022,9,0.00,V,0.00,...,0.00,V,0.00,V,0.30,V,0.00,V,0.00,N
930,28,79,59,89,28079059_89_98,2022,10,0.00,V,0.00,...,0.00,V,0.00,V,0.00,V,0.00,V,1.90,V
931,28,79,59,89,28079059_89_98,2022,11,0.00,V,0.00,...,0.00,V,3.40,V,0.00,V,0.00,V,0.00,N
932,28,79,59,89,28079059_89_98,2022,12,0.00,V,0.00,...,0.00,V,0.00,V,0.00,V,0.00,V,0.00,V

In [ ]:
df.MAGNITUD.unique()

array([81, 82, 83, 86, 87, 88, 89, 80])

<a name="Merge"></a>
### Merge

En este caso se busca unir dos dataframes fijándonos en las coincidencias entre valores de dos columnas

In [ ]:
from pandas import DataFrame
from pandas import Series
import pandas as pd
from random import sample
df1 = DataFrame({'clave': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                 'data1': range(7),
                 'otro': sample(range(10, 30), 7)})

df2 = DataFrame({'clave': ['a', 'b', 'b', 'd'],
                 'data2': range(4)})
display_side_by_side(df1,df2)

Por defecto la mezcla es por la columna que se llama igual

In [ ]:

display_side_by_side(df1,df2, pd.merge(df1,df2),title="pd.merge(df1,df2)")

pd.merge(df1,df2)

Si no se indica lo contrario, `merge` busca columnas comunes y hace un (inner) 'join'. Nótese que en este caso no se tienen en cuenta los índices
<br><br>

El método merge se puede llamar también dentro de un dataframe (es equivalente)

In [ ]:
df1.merge(df2)

  clave  data1  otro  data2
0     b      0    23      1
1     b      0    23      2
2     b      1    13      1
3     b      1    13      2
4     a      2    22      0
5     a      4    25      0
6     a      5    21      0
7     b      6    27      1
8     b      6    27      2

También se pueden unir por varias columnas, que podemos especificar directamente con los parámetros `left_on`y `right_on`

In [ ]:

df3 = df1.merge(df2, left_on=['clave','data1'], right_on = ['clave','data2'])

display_side_by_side(df1,df2, df3)

Si la clave o claves por las que querenos unir se llaman ambas igual podemos usar simplemente `on`

In [ ]:
df3 = pd.merge(df1,df2,on='clave')
display_side_by_side(df1,df2, df3)

Además de *inner* join, se pueden hacer con el parámetro `how` tomando valores *left*, *right*, *outer*, *inner*

<img src="https://www.golinuxcloud.com/wp-content/uploads/types_joins-1320x961.png">

En el caso de left, right y full/outer si la columna no encaja se rellenan con valores NaN

In [ ]:
df3 = df1.merge( df2, on='clave', how='left')
display_side_by_side(df1,df2, df3)

**Ejercicio** En

https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/tweetsCompletadoOrdenRename.csv

Tenemos datos de tweets, incluyendo el identificador del usuario que que ha emitidos cada tweet,  `userid`.

En

https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/usersrentaf.csv

tenemos datos de usuarios: sú número de seguidores, la renta de la zona donde viven, etc. En este caso el identificador se llama simplemente `id`.

Queremos unir ambos ficheros, de forma que a cada tweet se le añadan los datos de su usuario. Si un tweet no tiene su usario en el segundo conjunto de datos debemos borrarlo. Igualmente si un usuario no tiene ningún tweet no se incluirá.

In [ ]:
import pandas as pd
url_tweets = "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/tweetsCompletadoOrdenRename.csv"
url_users = "https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/usersrentaf.csv"
df_tweets = pd.read_csv(url_tweets)
df_users = pd.read_csv(url_users)

In [ ]:
df_tweets.columns

Index(['userid', '_id', 'screen_name', 'text', 'hora', 'foto/vídeo', 'foto',
       'video', ''¡'', ''!'', ''¿'', ''?'', 'menciones', 'hashtags', 'URLs',
       'emojis', 'sentimiento medio emojis', 'palabras',
       'proporción palabras correctas', 'longitud media palabras',
       'mayúsculas', 'números', 'palabras vacías', 'adjetivos', 'sustantivos',
       'verbos', 'tiempo pasado', 'tiempo presente', 'tiempo futuro',
       'tiempo imperfecto', 'tiempo condicional', 'modo imperativo',
       'modo indicativo', 'modo subjuntivo', 'primera persona',
       'segunda persona', 'tercera persona', 'singular', 'plural',
       'infinitivo', 'gerundio', 'participio', 'estoy en'],
      dtype='object')

In [ ]:
df_users.columns

Index(['id', 'screen_name', 'name', 'followers', 'created_at', 'friends_count',
       'location', 'ntweets', 'verified', 'nTotal', 'tweets', 'localidad',
       'provincia', 'distrito', 'seccion', 'cambio1518', 'mediana',
       'rentapaismin', 'rentapaismax', 'rentacommin', 'rentacommax'],
      dtype='object')